In [205]:
import pandas as pd
import numpy as np
import cx_Oracle as cx
import csv
from pandas import DataFrame

df=pd.read_csv('./intflowdb.csv')

df['current_dt'] = df['current_dt'].astype(str)

In [148]:
conn = cx.connect("hr", "hr", "localhost:1521/xe")
cursor = conn.cursor()  # 커서 생성
print('oracle 접속 성공')

oracle 접속 성공

In [206]:
#df['current_dt'][df['current_dt'].str.len()==15].str.replace(" ","")
df['current_dt'] =np.where(df['current_dt'].str.len()==15,df['current_dt'].str.replace(" ","0"),df['current_dt'])
df['current_dt']

0      2021-02-17 11:00
1      2021-02-17 11:00
2      2021-02-17 11:00
3      2021-02-17 11:00
4      2021-02-17 11:00
             ...
307    2021-02-19 11:00
308    2021-02-19 11:00
309    2021-02-19 11:00
310    2021-02-19 11:00
311    2021-02-19 11:00
Name: current_dt, Length: 312, dtype: object

In [207]:
df.current_dt=df.current_dt.str.replace(":","")
df.current_dt=df.current_dt.str.replace("-","")
df.current_dt=df.current_dt.str.replace(" ","")
df['current_dt']

0      202102171100
1      202102171100
2      202102171100
3      202102171100
4      202102171100
           ...
307    202102191100
308    202102191100
309    202102191100
310    202102191100
311    202102191100
Name: current_dt, Length: 312, dtype: object

In [208]:
def scc(x):
    return x[6:]
df['current_dt']=df['current_dt'].apply(scc)
df['current_dt']

0      171100
1      171100
2      171100
3      171100
4      171100
        ...
307    191100
308    191100
309    191100
310    191100
311    191100
Name: current_dt, Length: 312, dtype: object

In [18]:
df['current_dt'] = df['current_dt'].astype(int)
df

     current_dt  camera_id  object_id  activity  feed  drinking
0        171100          1          1        72    36        56
1        171100          1          2        85    77        62
2        171100          1          3        31    37         5
3        171100          1          4         6    99        95
4        171100          2          1        23    36        74
..          ...        ...        ...       ...   ...       ...
307      191100          2          4        85    30         9
308      191100          3          1         7    86        70
309      191100          3          2        65    41        89
310      191100          3          3        88     8        80
311      191100          3          4        48    31        71

[312 rows x 6 columns]

In [209]:
cursor.execute("DELETE FROM itf")

In [210]:
def insert(a,b,c,d,e,f):
    sql  = f"insert into itf values({a},{b},{c},{d},{e},{f})"
    cursor.execute(sql)
    conn.commit()

In [211]:
for i in range(0,312) :
    a=df.loc[i][0]
    b=df.loc[i][1]
    c=df.loc[i][2]
    d=df.loc[i][3]
    e=df.loc[i][4]
    f=df.loc[i][5]
    insert(a,b,c,d,e,f)